from enum import Enum
import time


class Constants:
    """Класс с константами"""
    lower_coord, upper_coord = 20, 1080
    lower_date = 1318808725

    likes = {
        1: [5, 20],
        2: [20, 35],
        3: [35, 50],
        4: [50, 65],
        5: [65, 80]
    }

    roles = [
        "ребенок", "мать", "отец", "старик", "студент",
        "бизнесмен", "домохозяйка", "путешественник", "гурман", "геймер",
        "подросток", "пенсионер", "спортсмен", "художник", "любитель музыки",
        "киноман", "книголюб", "технофил", "эколог", "авантюрист",
        "шопоголик", "гастрономический критик", "эксперт по красоте",
        "здоровьесберегающий", "владелец домашних животных", "автолюбитель", "владелец дома"
    ]

    months_dict = {
        "Jan": "Янв",
        "Feb": "Фев",
        "Mar": "Мар",
        "Apr": "Апр",
        "May": "Май",
        "Jun": "Июн",
        "Jul": "Июл",
        "Aug": "Авг",
        "Sep": "Сен",
        "Oct": "Окт",
        "Nov": "Ноя",
        "Dec": "Дек"
    }

    days_dict = {
        "Mon": "Пн",
        "Tue": "Вт",
        "Wed": "Ср",
        "Thu": "Чт",
        "Fri": "Пт",
        "Sat": "Сб",
        "Sun": "Вс"
    }

    reviews_rating_by_index = {
        0: 1,
        1: 1,
        2: 2,
        3: 2,
        4: 3,
        5: 3,
        6: 4,
        7: 4,
        8: 5,
        9: 5
    }

    path_to_cities_folder = "static/imgs/Города"
    path_to_reviews_folder = "static/reviews"
    path_to_description_folder = "static/descriptions"
    path_to_sites_folder = "static/sites"
    path_to_sites_data = "static/sites.json"
    
    @staticmethod
    def get_feedback_prompts(role, category, prompt, rate):
        return [
            f"""
            Тебе разрешено писать только на русском
            Твоя роль - {role}. Напиши небольшой отзыв для этой категории - {category} в стиле обычного обывателя.
            Учитывай ключевые аспекты, такие как удобства, сервис, цена и тому подобное (все, чего тебе не хватает, разрешено придумать в зависимости от необходимого рейтинга ( от 1 до 5 звезд)).
            Целевая аудитория – туристы, планирующие отдых.
            Отзывы должны быть информативными и полезными.
            Твоя задача — написать отзыв о {prompt} с оценкой {rate}.
            Предоставь ответ в формате plain text, избегая использования markdown-разметки. Не включай заголовки, списки, ссылки или другие элементы форматирования
            Запрещено писать перевод вашего ответа
            Запрещено писать, что вы ассистент или бот
            """,
            
            f"""
            Тебе разрешено писать только на русском
            Твоя роль - {role}. Напиши всесторонний и детализированный отзыв для этой категории - {category}.
            Учитывай ключевые аспекты, такие как удобства, сервис, цена и тому подобное (все, чего тебе не хватает, разрешено придумать в зависимости от необходимого рейтинга ( от 1 до 5 звезд)).
            Целевая аудитория – туристы, планирующие отдых.
            Отзывы должны быть информативными и полезными.
            Твоя задача — написать отзыв о {prompt} с оценкой {rate}.
            Ты должен дать оценку по всем аспектам.
            Предоставь ответ в формате plain text, избегая использования markdown-разметки. Не включай заголовки, списки, ссылки или другие элементы форматирования
            Запрещено писать перевод вашего ответа
            Запрещено писать, что вы ассистент или бот
            """,
            f"""
            Тебе разрешено писать только на русском
            Твоя роль - {role}. Напиши короткий отзыв для этой категории - {category}.
            Учитывай разные ключевые аспекты (все, чего тебе не хватает, разрешено придумать в зависимости от необходимого рейтинга ( от 1 до 5 звезд)).
            Целевая аудитория – туристы, планирующие отдых.
            Твоя задача — написать отзыв о {prompt} с оценкой {rate}.
            Предоставь ответ в формате plain text, избегая использования markdown-разметки. Не включай заголовки, списки, ссылки или другие элементы форматирования
            Запрещено писать перевод вашего ответа
            Запрещено писать, что вы ассистент или бот
            """,
            f"""
            Тебе разрешено писать только на русском
            Твоя роль - {role}. Напиши короткий отзыв для этой категории - {category}.
            Целевая аудитория – туристы, планирующие отдых.
            Твоя задача — написать отзыв о {prompt} с оценкой {rate}.
            Предоставь ответ в формате plain text, избегая использования markdown-разметки. Не включай заголовки, списки, ссылки или другие элементы форматирования
            Запрещено писать перевод вашего ответа
            Запрещено писать, что вы ассистент или бот
            """
        ]
    
    @staticmethod
    def get_description_prompt(prompt, category):
        return f"""
            Тебе разрешено писать только на русском
            Напиши описание локации {prompt} для этой категории - {category}.
            Не пиши про уникальность места
            Предоставь ответ в формате plain text, избегая использования markdown-разметки. Не включай заголовки, списки, ссылки или другие элементы форматирования
            Запрещено писать перевод вашего ответа
            Запрещено писать, что вы ассистент или бот
            """